---
kind: property
id: P:Autodesk.Revit.DB.Architecture.RailingType.TopRailHeight
source: html/95f867c3-7105-b8fc-d5b8-87b197621e41.htm
---
# Autodesk.Revit.DB.Architecture.RailingType.TopRailHeight Property

The height of the top rail in the railing system.

## Syntax (C#)
```csharp
public double TopRailHeight { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: The given value for height must be between 0 and 30000 feet.